### Merging

In [47]:
import pandas as pd
# https://dk81.github.io/dkmathstats_site/set-theory-sql.html
# images/set_theory.pdf
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html?highlight=merge#pandas.DataFrame.merge

staff_df = pd.DataFrame([
    {'Name': 'Kelly', 'Role': 'Director of HR'},
    {'Name': 'Sally', 'Role': 'Course liasion'},
    {'Name': 'James', 'Role': 'Grader'},
])
staff_df = staff_df.set_index('Name')

In [48]:

student_df = pd.DataFrame([
    {'Name': 'James', 'School': 'Business'},
    {'Name': 'Mike', 'School': 'Law'},
    {'Name': 'Sally', 'School': 'Engineering'},
])
student_df = student_df.set_index('Name')

outer = union = full outer join

![Outer](images/img_fulljoin.png)

In [49]:
# from the docs
# outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

inner = intersection = inner join

![Inner](images/word-image-150.png)

In [50]:
# from the docs
# inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

A left join selects everything from A including the intersection A∩B. If the null part is TRUE then the intersection removed and the A only part would be selected which is like A−B=A∩B^c.
<div>
<img src="images/left.png" width="300"/>
</div>

In [51]:
# from the docs
# left: use only keys from left frame, similar to a SQL left outer join; preserve key order.
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

It would be similar with the right join with B where the intersection A ∩ B is selected as well. If the null part is TRUE then the intersection removed and the A only part would be selected which is like B − A = B ∩ A^c .

![Right](images/right.png)

In [52]:
# from docs
# right: use only keys from right frame, similar to a SQL right outer join; preserve key order.
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [53]:
# Another way to do that is using merge with the "on" parameter
# It defines the column to merge both dataframes
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how="right", on="Name")

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

---

Now, what happens if both dataframes have the same key besides the merge column?

In [54]:
# Notice that were pandas is going to keep both, and some important
# is remembering that _x reffers to left table and _y to right table
# Let's see this example
staff_df = pd.DataFrame([
    {'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
    {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
    {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'},
])
student_df = pd.DataFrame([
    {'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
    {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
    {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'},
])

pd.merge(staff_df, student_df, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

Now, Take a look. What happens if we have someone named James Wilde and James Hammond?

In [55]:
staff_df = pd.DataFrame([
    {'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR', },
    {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion', },
    {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader', },
])
student_df = pd.DataFrame([
    {'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business', },
    {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law', },
    {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering', },
])
pd.merge(staff_df, student_df, how='right', on=['First Name', 'Last Name'])

  First Name Last Name            Role       School
0      James   Hammond             NaN     Business
1       Mike     Smith             NaN          Law
2      Sally    Brooks  Course liasion  Engineering

In [56]:
pd.merge(staff_df, student_df, how='inner', on=['First Name', 'Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

To merge horizontally use .concat

https://pandas.pydata.org/docs/reference/api/pandas.concat.html?highlight=concat#pandas.concat